[{"frontmatter":{"title":"Astro con Fabio Biondi","categories":["Meetup","RomaJS","Astro","SSG"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-12-26-astro-con-fabio-biondi","markdown":"\nMercoledì 21 Dicembre 2022 [Fabio Biondi](https://it.linkedin.com/in/fabiobiondi), nel meetup\noffline ed in presenza di Dicembre, ci ha parlato della sua esperienza con [AstroJS](https://astro.build/).\n"},{"frontmatter":{"title":"La nostra esperienza con TailwindCSS","categories":["Meetup","RomaJS","Css","Tailwind"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-11-16-la-nostra-esperienza-con-tailwindcss","markdown":"\nDopo 2 anni di esperienza usando TailwindCSS nel nostro quotidiano, vogliamo portarvi le nostre impressioni, i problemi che abbiamo riscontrato ed i motivi per cui è diventato uno strumento di cui non riusciamo più a fare a meno.\n\nIn questo talk parleremo della sua evoluzione nel tempo, dei miglioramenti che ha portato nella nostra Developer Experience e come lo abbiamo usato nei nostri progetti.\n\nScriverai ancora CSS? Forse si, ma ti divertirai di più.\n\nSpeakers: **Alfredo Mastropierro & Paolo Ferracchiati**\n"},{"frontmatter":{"title":"The new wave of Javascript Frameworks","categories":["Meetup","RomaJS","Javascript","React","SolidJS","Qwik","SSR"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-10-19-the-new-wave-of-javascript-frameworks","markdown":"\nDopo qualche anno di stabilità quelli che erano framework \"bleeding-edge\" (React, Vue, Angular) sono ufficialmente entrati nella categoria \"boring\".\n\nPer superare i limiti delle tecnologie \"boring\" una nuova ondata di framework è emersa, e le due principali star sono Solid.js e Qwik.\nMa come funzionano e perchè dovremmo interessarcene?\n\nIn questo talk esploreremo insieme queste nuove tecnologie cercando se sono troppo \"bleeding\" o se vale la pena considrarle nel nostro prossimo Cool Project™\n\nSpeakers: Fabrizio A. Vitale & Guido D'Orsi\n"},{"frontmatter":{"title":"How to Manage Technical Debt","categories":["Meetup"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-09-20-how-to-manage-technical-debt","markdown":"\nA practical take about where debt comes from, how to prevent it, and how to prioritize it against other company initiatives. Lessons learned from talking with 100+ engineers and managers from the http://refactoring.club community.\n\nSpeaker: Luca Rossi, Founder & Writer @refactoringclub\n\nRimarremo in ascolto di tutti i commenti sulle due piattaforme, ed avremo un canale #diretta dedicato sul nostro slack (trovate il link di invito su https://romajs.org/) dove poter interagire ulteriormente con tutti gli altri.\n"},{"frontmatter":{"title":"Happy birthday RomaJS!","categories":["Meetup","React","NextJS"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-07-14-happy-birthday-romajs","markdown":"\nQuesto meetup è speciale perché festeggiamo il 9° compleanno del RomaJS! E lo facciamo con un doppio talk!\n_Storia di un side project Next.js, serverless, su Twitch._\n\nSpesso ci troviamo ad immaginare di sviluppare un side project, di quelli che pensiamo siano utilissimi e che potrebbero spopolare nel giro di pochi giorni.\nAllora creiamo la nostra nuova cartella sul desktop, a volte compriamo anche il dominio, iniziamo a buttare giù due modelli, installiamo qualche dipendenza, scriviamo le prime righe di codice... e di lì a poco si interrompe la magia. Non so voi, ma io penso di avere una decina di cartelle di side project interrotti.\nVi racconterò di uno di questi side project e di come in meno di due mesi sia stato pubblicato, giocando con alcune tecnologie serverless quali Vercel, Google Firestore, sviluppando l'80% del core in live su Twitch. Una piccola retrospettiva tecnica e psicologica su quanto appreso.\n\nSpeaker: Matteo Manchi, CTO @ Impronta Group\n\n_React design patterns & hacks from the community - Episode 1_\nSviluppare applicazioni React non è per niente facile, e avere un buon vocabolario di pattern aiuta a semplificare la soluzione dei problemi più comuni.\nVedremo anche usi non convenzionali di feature di React, se poi chiamarli pattern o semplici hack lascierò deciderlo a voi!\nCercherò di raccogliere un po' di proposte di pattern/hack dalla community, sperando di creare una collezione così ampia da riuscire a farci una serie! (contattatemi su Slack se avete qualche pattern/hack da condividere).\n\nSpeaker: Guido D'Orsi, Frontend Performance Engineer @ Float\n"},{"frontmatter":{"title":"fp-ts spiegato a mio figlio","categories":["Meetup","fp-ts","Functional programming"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-06-14-fp-ts-spiegato-a-mio-figlio","markdown":"\nUn approccio pragmatico per iniziare a usare la programmazione funzionale in Typescript evitando lo scoglio della teoria.\n\nRiferimenti: https://github.com/gcanti/fp-ts\n\nSpeaker: Emanuele De Cupis @ PagoPA\n"},{"frontmatter":{"title":"Data fetching in React 18 apps","categories":["Meetup","React","SSR","rtk-query","swr","react-query"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-05-17-data-fetching-in-react-18-apps","markdown":"\nLa presentazione si focalizzerà sulle varie soluzioni di data fetching per applicazioni react con focus sulle sequenti librerie:\n\n- rtk-query (reduxjs/tookit)\n- react-query\n- SWR\n\nVerrano spiegate le varie modalità di data fetching e quali problemi le librerie menzionate risolvono.\nVerranno mostrati i pro e contro di queste soluzioni con focus sulla gestione dei dati, devtools e bundle size.\n\nIl talk poi presenterà il funzionamento di Suspense, la differenza tra le implementazioni in react 17 e react 18, e come queste librerie, mostrando snippet dei sorgenti, implementano suspense mode sul client e sul server (SSR).\n"},{"frontmatter":{"title":"Meetup di Aprile 2022 - Rome","categories":["Meetup","Rust","Rome Toolchain"],"lang":"it","createdAt":"Meetup di Aprile 2022 su Rome toolchain","author":"RomaJS team"},"url":"/blog/post/2022-07-03-meetup-di-aprile-2022-rome","markdown":"\nNel meetup di questo mese parleremo del progetto Rome, la nuova toolchain per lo sviluppo web che include formatter, linter, bundler ed altro. E lo faremo con Emanuele Stoppa, maintainer del progetto.\n\nAppuntamento ore 18:50 presso The Hub - LVenture Group. Per accedere all'edificio è necessario iscriversi qui:\nhttps://community.codemotion.com/romajs/meetups/roma-meetup-aperitech-di-aprile-2022-di-romajs\nSeguirà la classica cena di networking con chi si ferma :)\n\nSe non potete partecipare fisicamente, potete seguirci in diretta live su:\n\n- Facebook: https://www.facebook.com/1594098737474547/posts/3024622907755449/\n- YouTube: https://www.youtube.com/watch?v=rBpeOOc2rE8\n"},{"frontmatter":{"title":"Sessione sulle WebPerformance","categories":["Meetup","Javascript","Performance","web"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-03-13-sessione-sulle-webperformance","markdown":"\nFaremo un overview di WebPageTest e del performance profiler di Chrome.\n\nCi divertiremo anche ad analizzare qualche applicazione web pubblica provando a correggerne i problemi di performance se ne troviamo (si, si può fare anche non avendo accesso alla codebase, vi farò vedere come).\n\nSi accettano proposte sulle applicazioni da profilare, siate creativi!\n\nSpeaker: Guido D'Orsi\n"},{"frontmatter":{"title":"Doppio talk per il meetup di Febbraio!","categories":["Meetup","React","react-hook-form"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2022-07-03-doppio-talk-per-il-meetup-di-febbraio","markdown":"\nMercoledì torna l'appuntamento con il RomaJS, in presenza e in digitale, con un doppio talk!\n\nQuesto mese si parla di react-hook-form con Guido D'Orsi, Frontend Engineer @ NearForm e parleremo di design-system open source con Marco Liberati, Software Engineer @ Elastic.\n\nCi ritroviamo mercoledì 16 Febbraio presso The Hub - LVenture Group con inizio alle ore 19:00.\nPer partecipare fisicamente, vi ricordo che dovete iscrivervi a questo indirizzo (posti limitati, super green pass e ffp2):\nhttps://community.codemotion.com/…/roma-meetup-aperitech-di…\n\nPer l'evento digitale ci trovate in diretta sulla nostra pagina Facebook e sul nostro canale Youtube.\nhttps://www.youtube.com/watch?v=x-468wlfGgs\n\n`#neverstoplearning`\n\nIl meetup aderisce all'iniziativa #AperiTech di Codemotion in collaborazione con LVenture Group, il punto di aggregazione per tutte le community e gli sviluppatori italiani.\n\nA loro va tutto il nostro ringraziamento per quanto fanno sul territorio.\n\n- Telegram #AperiTech https://t.me/aperitech\n- Calendario del Developer https://bit.ly/devcalendar\n- Codemotion Tech Community https://bit.ly/CodemotionTC\n"},{"frontmatter":{"title":"E2E con Playwright","categories":["Meetup","Javascript","e2e","testing"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-12-14-e2e-con-playwright","markdown":"\nTerzo mercoledì del mese => Meetup del RomaJS!\n\nDomani sera parliamo di automazione e E2E testing con Playwright. In questo viaggio ci accompagna Enrico Polanski, Software Engineer @ TUI Musement nonché attivissimo membro della nostra community.\nVi ricordiamo che siamo tornati in presenza, quindi ci trovate Mercoledì 15 Dicembre alle 19:00 al The Hub - LVenture Group sopra la stazione Termini.\n\nPer partecipare in presenza dovete registrarvi su (posti limitati!) https://community.codemotion.com/.../roma-meetup...\nAndremo comunque live sui nostri canali:\n\n- Facebook: https://www.facebook.com/romajs.org/posts/2930238600527214\n- YouTube: https://www.youtube.com/watch?v=BqbPLUWMJcM\n\nPer rimanere in contatto con tutti i prossimi eventi RomaJS potete seguirci qui su facebook e su https://www.meetup.com/it-IT/RomaJS/\n\nIl meetup aderisce all'iniziativa #AperiTech di Codemotion in collaborazione con LVenture Group, il punto di aggregazione per tutte le community e gli sviluppatori italiani.\n"},{"frontmatter":{"title":"Questo mese parliamo di Svelte","categories":["Meetup","Svelte"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-11-17-questo-mese-parliamo-di-svelte","markdown":"\nQuesto mese parliamo di Svelte (https://svelte.dev/) “The new guy” nel panorama dei framework Javascript. E lo facciamo con Guido D'Orsi, Frontend Engineer @ Immobilare.it, che ci mostrerà come ha sviluppato un piccolo videogame utilizzando Svelte.\n\n_TrandyTrash - Diamo uno sguardo a Svelte sviluppando un videogame_\n\nSvelte è ormai uno UI framework abbastanza maturo che sta diventando sempre più popolare.\nPer soddisfare la nostra curiosità abbiamo scelto di sperimentarlo sviluppando un piccolo clone di CandyCrush.\n\nIn questo talk parleremo di questa nostra esperienza con Svelte e cercheremo di capire cosa lo rende così speciale.\n"},{"frontmatter":{"title":"WebVitals - Lessons learned optimizing a Next.js application","categories":["Meetup","NextJS","Performance","Web vitals"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-10-20-webvitals-lessons-learned-optimizing-a-nextjs-application","markdown":"\nCome di consueto il terzo mercoledì del mese è targato RomaJS e dalle 19:00 proviamo ad avere un confronto diretto con la community.\nRiprendiamo alla grande dopo la pausa estiva, e dopo la chiusura nazionale, con una tematica che chiunque nella filiera dello sviluppo di codice che gira su web si è posto:\n\nil mio sito/app è performante? Lato esperienza utente, di caricamento e interazione, è valido? Quali tool mi possono aiutare a monitorare la situazione?\nNe discutiamo con Guido D'Orsi, Frontend Engineer @ Immobilare.it, con cui vedremo cosa sono i WebVitals, come leggere ciò che ci propone e come intervenire sul nostro codice.\n\n_WebVitals - Lessons learned optimizing a Next.js application_\n\nOttimizzare la qualità della User Experience è la chiave del successo di qualsiasi sito web.\n\nCon i Web Vitals si può quantificare l’esperienza fornita da un’applicazione web e identificare opportunità per migliorarla.\nIn ImmobiliareLabs abbiamo preso la cosa molto sul serio e abbiamo lavorato duro per ottimizzare l’esperienza fornita dalla nostra applicazione Next.js.\nIn questo talk esploreremo nel dettaglio cosa sono i Web Vitals e condivideremo con voi le sfide affrontate e i trick utilizzati per ottenere un buono score.\n\nSpeaker: Guido D'Orsi\n"},{"frontmatter":{"title":"We're back!","categories":["Meetup"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-10-19-were-back","markdown":"\nCon molta emozione, è giunto finalmente il momento. Dopo 20 estenuanti mesi, torniamo finalmente in presenza con il nostro meetup mensile.\n\nTorniamo nell'innovativa The Hub - LVenture Group con sono solo 30 posti disponibili. Le norme sono le solite: accesso con green pass valido e mascherina su naso e bocca per tutta la durata dell'evento.\n\nParallelamente faremo l'evento online con la diretta del meetup. Trovate i link alla diretta sulla pagina Facebook e su Youtube.\nPer iscrivervi al meetup fisico: https://www.meetup.com/RomaJS/events/281442081\nPer seguire il meetup online, il canale che preferite:\n\n- Facebook: https://www.facebook.com/romajs.org/posts/2890997747784633\n- YouTube: https://www.youtube.com/watch?v=MhaS5DGQdm0\n\nSe volete mettere un \"follow\" sulla pagina meetup.com così da rimanere sintonizzati con i prossimi appuntamenti, qui il link: https://www.meetup.com/RomaJS/\n"},{"frontmatter":{"title":"Web XR State of the ARt","categories":["Meetup","Web XR","WebAR"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-07-21-web-xr-state-of-the-art","markdown":"\nRossi nel logo, socialmente e fisicamente distanziati, ma uniti da una grande passione per lo sviluppo, l'apprendimento e il javascript. Come di consueto il terzo mercoledì del mese è targato RomaJS e dalle 18:30 proviamo ad avere un confronto diretto con la community.\n\nMa dopo il boom dei Google Glasses e dell'Oculus, ad oggi è possibile fare AR/VR con le tecnologie del web? Ne parleremo con Nicolò Carpignoli, Web Developer @ Chialab e Invited Expert at W3C, nonché maintainer di AR.js.\n\n_Web XR State of the ARt_\n\nWeb XR means to deliver AR experiences on the Web, using any browser, without even requiring to use specific devices, like headsets. In this talk I will showcase technologies and platforms available in 2021, to build Web XR experiences for free, highlighting pros/cons, devices, support and future plans for each of them. This talk has been thought to be a good way to start with WebAR.\n\nSpeaker: Nicolò Carpignoli\n"},{"frontmatter":{"title":"Reiterating JavaScript & Node.js iterators","categories":["Meetup","NodeJS"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-06-16-reiterating-javascript-and-nodejs-iterators","markdown":"\nRossi nel logo, socialmente e fisicamente distanziati, ma uniti da una grande passione per lo sviluppo, l'apprendimento e il javascript.\n\nCome di consueto il terzo mercoledì del mese è targato RomaJS e dalle 18:30 proviamo ad avere un confronto diretto con la community.\n\nQuesto mese abbiamo un ospite speciale per fare un deep dive su un argomento utile in tutti gli ambiti dove applichiamo JavaScript ed in particolare Node.js.\n\nPer farlo, avremo con noi Luciano Mammino, Senior Architect @ fourTheorem, super speaker, autore di newsletter, non di meno, co-autore del libro Node.js Design Pattern (nodejsdesignpatterns.com).\n\n_Reiterating JavaScript & Node.js iterators_\n\nIn questo talk rivisiteremo i protocolli di iterazione offerti da JavaScript (iterable, iterator, async iterable & async iterator) esplorando anche generators e async generators. Ne approfitteremo per esplorare anche alcune applicazioni di questi pattern in Node.js confrontandoli con approcci piú tradizionali come event emitters e streams. In particolare discuteremo alcuni interessanti integrazioni tra questi paradigmi evidenziando patterns e anti-patterns!\n\nSpeaker: Luciano Mammino\n"},{"frontmatter":{"title":"Meetup Aprile 2021","categories":["React","testing","bundle size","software development"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-04-21-meetup-aprile-2021","markdown":"\nRossi nel logo, socialmente e fisicamente distanziati, ma un uniti da una grande passione per lo sviluppo, l'apprendimento e il javascript.\n\nCome di consueto il terzo mercoledì del mese è targato RomaJS e dalle 18:30 proviamo ad avere un confronto diretto con la community.\n\nQuesto mese si parla molto di esperienze: sia nel mondo open source che nel mondo closed. Con Marco Liberati vedremo la sua esperienza nella creazione di un piccolo progetto open source oggi pubblicato, mentre con Alessandro Miliucci si discuterà dell'uso di JavaScript come linguaggio per iniziare lo sviluppo software in una startup.\n\n_Il mondo in un bottone_\n\nUn piccolo racconto di come costruire un componente React per un bottone e poco più sia diventata un viaggio su cosa testare, cosa pubblicare, accessibilità e la ricerca del bundlesize giusto. Alla fine era solo un bottone e poi più…\n\nSpeaker: Marco Liberati\n\n_Il mito della startup JavaScript_\n\nDa diversi anni JavaScript è la prima scelta tecnologica di molte startup: un solo linguaggio, un unico stack, un gran numero di sviluppatori/trici disponibili...\n\nMa è veramente tutto oro quello che luccica? In questa presentazione cercheremo di guardare con occhio disincantato pro e contro di questa scelta, e cosa vuol dire legare il successo di una startup a JavaScript.\n\nSpeaker: Alessandro Millucci\n"},{"frontmatter":{"title":"Babel.js!","categories":["Meetup","Javascript","Babel","compilers"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-03-15-babeljs","markdown":"\nQuesto mese avremo il piacere di avere con noi Nicolò Ribaudo, maintainer e developer di **_Babel.js_** - e non penso che ci sia bisogno d'altro.\n\nMentre quasi tutta l'Italia finisce in zona rossa, noi rimaniamo rossi nel logo, socialmente e fisicamente distanziati, ma un uniti da una grande passione per lo sviluppo, l'apprendimento e il javascript.\n\nCome di consueto il terzo mercoledì del mese è targato RomaJS e dalle 18:30 proviamo ad avere un confronto diretto con la community.\n\nCon Nicolò andremo a parlare di Shrinking your bundle size with Babel: utilizzare dual bundles e le opzioni \"targets\"/\"assumptions\" di Babel per creare bundles più piccoli da mandare ai browser.\n"},{"frontmatter":{"title":"Meetup Febbraio 2021","categories":["Meetup","Kubernetes","CI CD"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-02-15-meetup-febbraio-2021","markdown":"\nFebbraio, mese degli innamorati. E questo mese affronteremo l'amore/odio degli sviluppatori con le operazioni di CI/CD/Configurazione.\nSolito terzo mercoledì del mese, solito orario 😉\n\n_Retrospettiva su un server di Continuous Integration_\n\nTra anni fa ho realizzato un piccolo server di CI integrato con github.\n\nÈ rimasto in servizio fino a qualche settimana fa, occupandosi delle build e dei test di decine di progetti. Ma com'è fatto, e come funziona, un software del genere?\n\nSpeaker: Alessandro Miliucci @lifeisfoo\n\n_Gestire la configurazione like a pro_\n\nDal più semplice deploy al più complesso dei progetti, i file di configurazione sono sempre di più: dalla gestione di diversi ambienti alla descrizione della struttura dell'applicazione in kubernetes.\nDi pari passo, si pone la necessità sempre maggiore di gestire questi file.\nVedremo quali sono le opzioni esistenti ed esploriamo uno degli approcci a me preferiti.\n\nSpeaker: Luca Lanziani @lucalanziani\n\nAncora una volta l'evento sarà interamente online su Facebook e YouTube. Pubblicheremo i link la settimana prima dell'evento.\nRimarremo in ascolto di tutti i commenti sulle due piattaforme, e avremo un canale #diretta dedicato sul nostro slack dove poter interagire ulteriormente con tutti gli altri.\n\nSe ancora non l'hai fatto, puoi entrare sul nostro slack tramite il nostro sito: http://romajs.org/\n"},{"frontmatter":{"title":"Meetup Gennaio 2021","categories":["Meetup","Fastify","NodeJS","testing"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2021-01-15-meetup-gennaio-2021","markdown":"\nPanettoni da una parte, pandori dall'altra, torroni davanti la tastiera... si riparte con questo nuovo anno ricco di JavaScript!\nE nel ripartire, lo facciamo con il botto con due speaker e due talk eccezionali!\n\n_Fastify 101_\n\nMixed logic, cross-dependencies, and way too many edge cases to test. Wouldn't it be great to have a framework that helps you build a modular, consistent, and pluggable system?\n\nEnter Fastify, a web framework for Node.js. Fastify offers an extremely flexible plugin system that allows complete customization of the framework. Every plugin could be packaged as an independent module and then deployed as a microservice or as a part of a monolith.\n\nIn this talk, you will learn all the concepts of Fastify and how they play together. Spoiler alert: opinions ahead!\n\nSpeaker: Tomas Della Vedova @ Elastic\n\nBio: https://gist.github.com/.../83bb7008b73a45b40479a2782db54a9a\n\nLingua: italiano\n\n_Breaking the fear of front-end testing_\n\nSe sei uno sviluppatore front-end e:\n\n- non hai mai testato la tua app perchè non hai tempo o perchè non ne percepisci il valore\n- ci hai provato ma non è stata un'esperienza profittevole\n- se hai mollato perchè è difficile testare e debuggare un'app front-end nel terminale\n  Allora questo talk è per te :wink:\n\nSpeaker: Stefano Magni, senior front-end engineer @WorkWave, instructor, Cypress ambassador\n\n- https://twitter.com/NoriSte\n- https://github.com/NoriSte\n- https://dev.to/noriste\n\nAncora una volta l'evento sarà interamente online su Facebook e YouTube. Pubblicheremo i link la settimana prima dell'evento.\nRimarremo in ascolto di tutti i commenti sulle due piattaforme, e avremo un canale #diretta dedicato sul nostro slack dove poter interagire ulteriormente con tutti gli altri.\n\nSe ancora non l'hai fatto, puoi entrare sul nostro slack tramite il nostro sito: http://romajs.org/\n"},{"frontmatter":{"title":"Meetup Dicembre 2020","categories":["Meetup","Javascript","React"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-12-15-meetup-dicembre-2020","markdown":"\nFino all'ultimo questo 2020 non smette di riservare sorprese ma di certo non potevamo mancare con l'ultimo meetup dell'anno.\nIn versione soft prima di rimpinzarsi nei cenoni di natale chiusi in casa, Mercoledì 16 Dicembre ci ritroviamo nella nostra diretta live con una tavola rotonda sugli State Management di React. Quattro chiacchiere tra personaggi di spicco della community tra esperienze ed esperimenti.\n\nATTENZIONE: è ampiamente richiesta partecipazione attiva sulla live chat!\n\nGli speaker d'eccezione (in rigoroso ordine alfabetico):\n\n- Alessandro Miliucci\n- Guido D'Orsi\n- Matteo Manchi\n- Paolo Mariotti\n\nPassate a creare flame sul vostro state management preferito o semplicemente a fare un saluto natalizio 🙂\n"},{"frontmatter":{"title":"Meetup Novembre 2020","categories":["Meetup","React","Fastify","react-query"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-11-18-meetup-novembre-2020","markdown":"\nMeno di un'ora al nostro appuntamento mensile!\n\nPotete seguirlo su:\n\nFacebook: https://www.facebook.com/romajs.org/posts/2657373197813757\nYoutube: https://www.youtube.com/watch?v=1UA6NuKxLM8\n\nGli argomenti della serata:\n\n_React Query, your next Asynchronous Data Manager_\n\nMolte applicazioni web oggi utilizzano state manager per gestire tutti i dati dell’applicazione, compresi quelli asincroni. Gli state manager però, non sono stati concepiti per questo scopo. In questo breve talk vi presento un’alternativa, react-query, uno “state-manager” per dati asincroni.\n\nSpeaker: Valerio Cestarelli, @v1ll0\n\n_Fastify autoroutes_\n\nFastest way to map directories to URLs in fastify\n\nSpeaker: Giovanni Cardamone\n"},{"frontmatter":{"title":"Meetup Ottobre 2020","categories":["Meetup","React","CI CD","Git","Github","Github Actions"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-10-18-meetup-ottobre-2020","markdown":"\nCome di consueto, la sera del terzo mercoledì del mese è targata RomaJS!\n\nGli argomenti della serata:\n\n_Github Actions: your new friend out of the box_\n\nHai sentito parlare delle Github Actions, forse hai anche aperto il nuovo tab sul tuo nuovo repository, ma non le hai ancora provate. Questo talk vuole introdurre questa nuova funzionalità del repository Github e mostrare alcuni casi d’uso, dai più classici ai più esotici, fino ad un’intero servizio su di esse.\n\nSpeaker: Marco Liberati @dej611\n\n_React, con stile_\n\nPrima di poter dare uno stile ai nostri componenti dobbiamo scegliere in che modo farlo, ma oggi le tecniche possibili sono molte. Con questa presentazione cercheremo di capire quali sono, come funzionano e come si differenziano. Infine, ne elencheremo i pro e i contro, mettendoli in relazione alle situazioni reali di utilizzo.\n\nSpeaker: Alessandro Miliucci @lifeisfoo\n"},{"frontmatter":{"title":"Meetup Settembre 2020","categories":["Meetup","React","Web"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-09-14-meetup-settembre-2020","markdown":"\nTitolo: React come lingua franca\n\nAutore: Alessandro Miliucci\n\nGuardare designer e sviluppatori lavorare a un’applicazione è (spesso) come vedere due fazioni rivali combattere per il controllo del territorio (l’app).\nSe invece di essere due forze contrapposte queste vengono unite e collaborano, il risultato può solo che essere superiore.\nMa per farlo c’è bisogno di una lingua comune con cui capirsi e spiegarsi in modo efficiente, e React in questo può essere un’ottima scelta.\n\nTitolo: Usare webcam e microfono nel browser\n\nAutore: Matteo Manchi\n\nCon l’avvento dell’HTML5 è stato reso possibile l’utilizzo dei dispositivi di cattura audio e video direttamente all’interno del browser, dando una delle stangate finali a plugin esterni (Flash o Silverlight). In questa breve pillola vedremo tutte le funzionalità legate al User Media API, come richiedere gli stream audio/video per poi manipolarli, salvarli o inviarli ad un utente remoto.\n"},{"frontmatter":{"title":"Meetup online Luglio 2020","categories":["Meetup","WebGL","Shaders","Image processing"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-07-15-meetup-online-luglio-2020","markdown":"\nContinuano le edizioni online del RomaJS!\n\nMercoledì 15 Luglio, venite a festeggiare con noi il compleanno della community 🎂\nQuesto mese Damiano, Simone e Alessandro ci parleranno di WebGL, non mancate! ⭐\n\n_WebGL Image Processing_\n\nHow to post-process images on the front-end using the powerful WebGL shaders.\n\nSpeaker: Alessandro Valeri, @alenaksu, Front-end Engineer @ Expedia\n\n_Implementazione parallela di un algoritmo di graph drawing utilizzando WebGL_\n\nLa visualizzazione di grafi sta diventando sempre più importante per l’analisi e la comprensione dei dati che ci circondano. La grande mole di questi dati può richiedere uno sforzo computazionale per cui anche i moderni processori non sono sufficienti. In questa sessione verrà preso in considerazione l’algoritmo di visualizzazione più utilizzato al giorno d’oggi, Spring Embedder di Peter Eades, mostrandone un’ implementazione parallela su GPU realizzata con WebGL.\n\nSpeaker: Damiano Massarelli - Software Engineer @ Zuru tech\n\nSpeaker: Simone Ceccarelli - Head of Data Visualization @ Larus\n"},{"frontmatter":{"title":"Meetup online Giugno 2020","categories":["Meetup","React"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-06-17-meetup-online-giugno-2020","markdown":"\nRomaJS torna anche a Giugno in versione full-remote! 🖥️\n\nQuesta volta ci terranno compagnia David Sorrentino e Guido D'Orsi per un meetup incentrato su React! 🚀\n\nVi aspettiamo come sempre il terzo mercoledì del mese a partire dalle 18:30\n"},{"frontmatter":{"title":"RomaJS is back! 🚀","categories":["Meetup"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-05-16-romajs-is-back","markdown":"\nLa quarantena non fermerà la nostra voglia di Javascript\n\nVi aspettiamo online per il meetup di maggio insieme ai due speaker di questo mese:\n\nMarco Liberati e Manuel Salvatore Martone.\n\nNon potete mancare!\n\nhttp://ow.ly/BR8u50zHZhO\n"},{"frontmatter":{"title":"TL;DR ANNULLATO MEETUP DI MARZO","categories":["Meetup","RomaJS"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-03-11-tldr-annullato-meetup-di-marzo","markdown":"\nCaro null,\n\nAbbiamo atteso quanto possibile, rimanendo in ascolto di tutti i canali istituzionali, sperando di non dover dare questa comunicazione. La situazione attuale è chiara per tutti ed è nostra e vostra responsabilità seguire le indicazioni statali per dare un duro colpo a questa epidemia e ristabilire la normalità quanto prima possibile.\n\nDichiariamo ufficialmente annullato il meetup fisico di Marzo.\n\nMantenendo il nostro impegno mensile, fatta salva nuova comunicazione, potete mettere a calendario Mercoledì 15 Aprile come prossimo meetup del RomaJS.\n\nSebbene #iorestoacasa, la community rimane viva sui canali digitali. Chi non l’ha ancora fatto, può entrare su slack tramite il link romajs.herokuapp.com e unirsi a centinaia di dev e appassionati della capitale.\n\nStiamo valutando la possibilità di effettuare qualche attività online la sera di mercoledì 18 marzo: siete invitati tutti sul canale slack per partecipare alla decisione ed onorare il terzo mercoledì del mese 🙂\n\nUn saluto a tutti,\n\nundefined is not a function\n"},{"frontmatter":{"title":"Meetup Febbraio 2020","categories":["Meetup","Scrum agile","Kanban"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-01-28-meetup-febbraio-2020","markdown":"\nAnche a Febbraio torna il RomaJS con due nuovi talk!\n\nJuna Salviati (@1littleendian) ci mostrerà come disegnare insieme al Google Assistant, mentre Marco Venturi ci parlerà di Scrum e Kanban.\n\nNon perdetevi l'evento, vi aspettiamo numerosi presso i locali di LUISS EnLabs alle ore 19:00\n\nPer partecipare è richiesta la registrazione su EventBrite al seguente link:\nhttp://ow.ly/12df50y73S5\n"},{"frontmatter":{"title":"Meetup Gennaio 2020","categories":["Meetup","NodeJS","Final Form"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2020-01-13-meetup-gennaio-2020","markdown":"\nSi comincia bene con il nuovo anno, il 15 Gennaio siete tutti invitati a partecipare al meetup di RomaJS.\n\nQuesto mese vi parleremo di:\n\n- NodeJS sul lungo periodo\n- Final Form\n\nVi aspettiamo presso i locali di LUISS EnLabs a Roma dalle ore 19:00.\n\nCome sempre è richiesta l'iscrizione su EventBrite http://ow.ly/P2ou50xTLx4\n"},{"frontmatter":{"title":"Meetup Dicembre 2019","categories":["Meetup","StencilJS","Web components","Microservice"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-12-09-meetup-dicembre-2019","markdown":"\n📢 Pronti per l'incontro di Dicembre?\n✌️ Questi sono i talk in programma:\n• Sviluppiamo web components riusabili con StencilJS\n• Yet Another Microservice Framework (in lingua inglese)\nPer registrarsi e per maggiori dettagli:\n\nhttps://www.eventbrite.it/e/biglietti-stenciljs-another-microservices-framework-romajs-dicembre-2019-85430519985\n"},{"frontmatter":{"title":"Meetup Novembre 2019","categories":["Meetup","Typescript","React","React Native","Functional programming"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-11-15-meetup-novembre-2021","markdown":"\nCiao ragazzi, anche questo mese arriva il RomaJS! Come sempre si tratteranno argomenti di alto interesse e ci si potrà confrontare con tutti gli appassionati di Javascript presenti all'evento, non mancate!\n\nA Novembre parleremo di:\n\n- Functional programming in TS\n- React Native: IO l’app dei servizi pubblici\n\nVi aspettiamo numerosi mercoledì 20 Novembre ore 19:00, presso LUISS EnLabs nel cuore di Roma Termini.\n\nÈ richiesta l'iscrizione su EventBrite\n"},{"frontmatter":{"title":"Meetup Ottobre 2019","categories":["Meetup","Web","a11y"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-10-08-meetup-ottobre-2019","markdown":"\nCiao a tutti! Il terzo mercoledì di Ottobre si avvicina, e con lui il classico appuntamento del RomaJS.\n\nQuesto mese vi proponiamo i seguenti talk:\n\n- Web A11y\n- StandardJS e altre fake news\n\nVi aspettiamo numerosi mercoledì 16 Ottobre, ore 19:00, presso LUISS EnLabs nel cuore di Roma Termini.\n\nCome sempre è richiesta l'iscrizione su EventBrite\n"},{"frontmatter":{"title":"Meetup Luglio 2016","categories":["Meetup","Data visualization"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-07-16-meetup-luglio-2016","markdown":"\nCiao a tutti! Come ogni mese, anche domani ci si vede al RomaJS per un meetup all'insegna delle speriementazioni, della\nvisualizzazione dati e del networking. Vi aspettiamo ad LUISS EnLabs nel cuore di Roma Termini.\n\nPS: è obbligatoria l'iscrizione su eventbrite\n"},{"frontmatter":{"title":"Meetup Giugno 2019","categories":["Meetup","Javascript","NodeJS"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-06-18-meetup-giugno-2019","markdown":"\nJavascripters! Come di rito, il terzo mercoledì si avvicina! Domani sera, ore 19 ad LUISS EnLabs ci si vede come ogni mese! I talk del mese sono:\n\n- Il futuro dei Package Manager JS, direttamente dalla jsConf EU\n- Introduzione all'uso di docker per sviluppare in ambiente node.js\n\nCi vediamo domani 😉\n"},{"frontmatter":{"title":"Meetup Maggio 2019","categories":["Meetup","Typescript"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-05-14-meetup-maggio-2019","markdown":"\nComunicato un po' all'ultimo, ma non mancheremo neanche questo terzo mercoledì del mese 😉 Ci vediamo domani, ore 19:00 a LUISS EnLabs con il nostro incontro mensile.\n\nhttps://www.eventbrite.it/e/biglietti-inversion-of-control-in-typescript-romajs-aperitech-60309787197\n"},{"frontmatter":{"title":"Meetup Aprile 2019","categories":["Meetup","React"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-04-15-meetup-aprile-2019","markdown":"\nAnche questo mese, il terzo mercoledì di Aprile, ci si incontra. Stesso posto, stesso orario, nuovi topic!\nCi vediamo mercoledì 17 nella grande LUISS EnLabs. Qui sotto il link per la registrazione gratuita 👇\n\nhttps://www.eventbrite.it/e/biglietti-react-hooks-dashboard-w-d3js-react-romajs-aperitech-57803869931\n"},{"frontmatter":{"title":"Meetup Marzo 2019","categories":["Meetup","Typescript","Flutter"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-03-19-meetup-marzo-2019","markdown":"\nE anche domani, come ogni terzo mercoledì del mese, ci vediamo ad LUISS EnLabs a parlare di Typescript e Flutter.\n\nNon mancate 😉\n\nhttps://www.eventbrite.it/e/biglietti-intro-a-typescript-flutter-vs-pwa-romajs-aperitech-56046978020\n"},{"frontmatter":{"title":"Meetup Febbraio 2019","categories":["Meetup","SSR","pwa"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-02-19-meetup-febbraio-2019","markdown":"\nEhilà, super dev! Come di consueto, ogni terzo mercoledì del mese™ ci si incontra al meetup!\nCi vediamo domani 😉\n\nhttps://www.eventbrite.it/e/biglietti-ssr-adventures-pwa-caching-strategies-romajs-aperitech-54875367702?aff=eac2\n"},{"frontmatter":{"title":"Meetup Gennaio 2019","categories":["Meetup","Ionic"],"lang":"it","createdAt":null,"author":"RomaJS team"},"url":"/blog/post/2019-01-14-meetup-gennaio-2019","markdown":"\nLe feste sono finite, il 2019 è entrato a gamba tesa e il RomaJS riparte.\n\n_ATTENZIONE:_ solo per questo mese, l'incontro non sarà Mercoledì 16 ma Mercoledì 23.\nCi vediamo tra poco più di una settimana 😉\n\nPS: ricordatevi di prendere il vostro biglietto gratuito su Eventbrite:\n\nhttps://www.eventbrite.it/e/biglietti-le-novita-di-ionic-4-google-mobile-web-specialist-romajs-aperitech-53657781870\n"},{"frontmatter":{"title":"First test post","categories":["RomaJS"],"lang":"en","createdAt":"The very first RomaJS blog post!","author":"Luca Lanziani"},"url":"/blog/post/2016-10-01-first-post","markdown":"\nToday, 1st Oct 2016, we add blog posts.\n\nThis is a **really basic** implementation, much more can be done here.\n\nNext steps can be:\n\n- Write a blog post on how to write blog posts\n- Improve blog page design\n- Write better css for blog post page\n- Add metadata to blog posts (author name/author pic/date)\n- Add related post section?\n- Add support for rss?\n\nThis is all for today, time for me to enjoy the weekend ;).\n\nLuca\n"}]